## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| update | `module.rds_cluster.aws_rds_cluster.cluster`                            |
|        | `module.rds_cluster.aws_rds_cluster_instance.instances[0]`              |
| add    | `module.rds_cluster.aws_cloudwatch_log_group.log_exports[&quot;postgresql&quot;]` |
|        | `module.rds_cluster.aws_security_group_rule.rds_proxy_egress`           |
|        | `module.rds_cluster.aws_security_group_rule.rds_proxy_ingress`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.rds_cluster.aws_cloudwatch_log_group.log_exports["postgresql"] will be created
  + resource "aws_cloudwatch_log_group" "log_exports" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/rds/cluster/saas-procurement-database-cluster/postgresql"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "saas-procurement"
          + "Name"       = "saas-procurement-database-cluster"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "saas-procurement"
          + "Name"       = "saas-procurement-database-cluster"
          + "Terraform"  = "true"
        }
    }

  # module.rds_cluster.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ copy_tags_to_snapshot               = false -> true
      ~ enabled_cloudwatch_logs_exports     = [
          + "postgresql",
        ]
      ~ engine_version                      = "14.9" -> "14.6"
        id                                  = "saas-procurement-database-cluster"
      ~ preferred_maintenance_window        = "thu:04:25-thu:04:55" -> "sun:06:00-sun:07:00"
        tags                                = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database-cluster"
            "Terraform"  = "true"
        }
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds_cluster.aws_rds_cluster_instance.instances[0] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "instances" {
      ~ engine_version                        = "14.9" -> "14.6"
        id                                    = "saas-procurement-database-instance-0"
        tags                                  = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database-instance-0"
            "Terraform"  = "true"
        }
        # (28 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_security_group_rule.rds_proxy_egress will be created
  + resource "aws_security_group_rule" "rds_proxy_egress" {
      + description              = "Proxy egress from the database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-051638cd60aef88c3"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # module.rds_cluster.aws_security_group_rule.rds_proxy_ingress will be created
  + resource "aws_security_group_rule" "rds_proxy_ingress" {
      + description              = "Proxy ingress to the database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-051638cd60aef88c3"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
